'''
При анализе данных, собранных в рамках научного эксперимента,
бывает полезно удалить самое большое и самое маленькое значение.

На вход программе подается натуральное число n, а затем n различных натуральных чисел.
Напишите программу, которая удаляет наименьшее и наибольшее значение из указанных чисел,
а затем выводит оставшиеся числа каждое на отдельной строке, не меняя их порядок.

Формат входных данных
На вход программе подаются натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''
n = int(input())
a = []
for i in range(n):
    a.append(int(input()))
m = max(a)
n = min(a)
for i in a:
    if i == m:
        del a[a.index(i)]
    if i == n:
        del a[a.index(i)]
print(*a, end='', sep='\n')